<?php

function isShijiaSchool($sid) {
    /* 1 '南京大学','东南大学','南京航空航天大学','南京理工大学','河海大学','南京农业大学','中国矿业大学','中国药科大学','江南大学','南京森林警察学院', 
     * 2 '南京师范大学','南京医科大学','南京中医药大学','南京艺术学院','南京体育学院','江苏第二师范学院','江苏开放大学','南京工业大学','南京财经大学','南京信息工程大学',
     * 3 '南京邮电大学','南京林业大学','南京审计学院','南京工程学院','江苏警官学院','江苏经贸职业技术学院','南京工业职业技术学院','南京科技职业技术学院','南京交通职业技术学院','南京特殊教育职业技术学院',
     * 4 '江苏省南京工程高等职业学校','南京信息职业技术学院','江苏海事职业技术学院','南京铁道职业技术学院','三江学院','钟山职业技术学院','应天职业技术学院','正德职业技术学院','中国传媒大学南广学院','南京航空航天大学金城学院',
     * 5 '无锡职业技术学院','江苏师范大学','徐州医学院','江苏建筑职业技术学院','徐州工业职业技术学院','江苏理工学院','常州大学','常州信息职业技术学院','常州纺织服装职业技术学院','常州工程职业技术学院',
     * 6 '苏州大学','苏州科技学院','常熟理工学院','苏州工艺美术职业技术学院','苏州经贸职业技术学院','南通大学','南通航运职业技术学院','江苏工程职业技术学院','淮海工学院','淮阴师范学院',
     * 7 '淮阴工学院','江苏食品药品职业技术学院','盐城师范学院','盐城工学院','扬州大学','扬州工业职业技术学院','江苏大学','江苏科技大学','南京团市委','无锡团市委',
     * 8 '徐州团市委','常州团市委','苏州团市委','南通团市委','连云港团市委','淮安团市委','盐城团市委','扬州团市委','镇江团市委','泰州团市委',
     * 9 '宿迁团市委'
     */
//      $all = array(473,587,588,584,585,524,594,622,595,526,600, //1
//          586,596,591,601,603,602,618,480,589,593, //2
//          592,590,597,598,604,606,614,607,610,609, //3
//          612,611,617,608,620,605,613,615,619,2136, //4
//          638,623,624,616,625,627,626,629,630,628, //5
//          1,2,639,621,507,631,632,633,640,528, //6
//          527,531,635,634,636,637,551,550,664,665, //7
//          666,667,668,669,670,671,672,673,674,675, //8
//          676);
    $all = array(473, 505, 587, 588, 584, 585, 524, 594, 622, 595, 526, 600, 586, 596, 591, 601, 603, 602, 618, 480, 589, 593, 592, 590, 597, 598
        , 604, 606, 614, 607, 610, 609, 612, 611, 617, 608, 620, 605, 613, 615, 619, 28613, 2136, 638, 623, 624, 616, 625, 627, 626, 629
        , 630, 628, 1, 2, 639, 621, 507, 631, 632, 633, 640, 528, 527, 531, 635, 634, 636, 637, 551, 550, 668, 664, 673, 671, 670, 667
        , 665, 676, 674, 666, 669, 675, 672, 28557, 28586, 28707, 2248, 2088, 28782, 2073, 2080, 2229, 28569, 28612, 28504, 28783
        , 2288, 28565, 28705, 402, 1908, 28611, 28784, 28706, 28702, 28703);
    return in_array($sid, $all);
}

function showShijiaBack($sid) {
    if ($sid == 505 || isShijiaSchool($sid)) {
        return true;
    }
    return false;
}
